{
  "url": "https://www.bbc.com/news",
  "timestamp": "2025-08-29T07:21:59.785651",
  "title": "BBC News - Breaking news, video and the latest top stories from the U.S. and around the world",
  "main_text": "Rohingya refugees tell the BBC they were flown from Delhi and forced into the sea off the coast of Myanmar.\nThe two children killed in the shooting have been identified as Fletcher Merkel, eight, and Harper Moyski, 10.\nThe high commissioner posts were vacant for 10 months, as both countries expelled each other’s top diplomats.\nThere is frenzy, fascination and even a little bit of FOMO as Koreans revel in the K-pop hit.\nWright was charged over a 2022 helicopter crash in remote crocodile territory, which killed his friend.\nThe two children killed in the shooting have been identified as Fletcher Merkel, eight, and Harper Moyski, 10.\nLawyers for Dr Susan Monarez say only the president can remove her from her job running the US Centers for Disease Control and Prevention.\nPolice believe the CCTV footage shows Tom Phillips and his child breaking into a store.\nWorkers and students take to the streets for the third time this week as anger grows over alleged lavish MP allowances.\nThe high commissioner posts were vacant for 10 months, as both countries expelled each other’s top diplomats.\nThe leaders of North Korea and Russia will attend China's military parade next week - a win for Xi.\nNetflix’s Jay Kelly sees the actor portray an ageing movie star, drawing parallels with his own life.\nThe deadly fire was called a \"wake-up call\" but residents are waiting for permanent homes.\nHow much attention did you pay to what happened in the world over the past seven days?\nIn the deadliest strike, a missile ripped through the middle of a low-rise block of flats.\nNetflix’s Jay Kelly sees the actor portray an ageing movie star, drawing parallels with his own life.\nFletcher Merkel, 8, was one of two children killed in Wednesday's shooting at Annunciation Catholic School in Minneapolis.\nTokyo authorities say they released the AI-generated video to raise awareness and help people prepare for disaster - but how likely is Mt Fuji to actually erupt?\nThe deadly fire was called a \"wake-up call\" but residents are waiting for permanent homes.\nA rise in popularity of vapes laced with etomidate, an anaesthetic drug, has caused widespread alarm.\nThe officers had been found guilty of witness tampering in the fatal 2023 beating\nThe Israeli military declined to comment on reports of the strikes, which Syria condemned.\nThe first group of deportees arrived in mid-August, according to government spokesperson Yolande Makolo.\nThe parasites mainly infest cattle but there have also been dozens of cases involving people.\nThe officers had been found guilty of witness tampering in the fatal 2023 beating\nOne young boy says he was protected from gunfire in a church by a friend who lay on top of him and was shot.\nRecent wildfires scorched vast areas across Turkey, but one orchard in the north-western province of Bursa stood untouched.\nThe Israeli military declined to comment on reports of the strikes, which Syria condemned.\nNaomi Osaka says Jelena Ostapenko's comments to Taylor Townsend about her having \"no class\" and \"no education\" was \"one of the worst things you could say to a black tennis player\".\nAll the latest Premier League news conferences and build-up, plus transfer updates.\nMicah Parsons has been traded from the Dallas Cowboys to the Green Bay Packers in a deal worth $188m only one week before the start of a new NFL season.\nBBC Sport football expert Chris Sutton takes on The Cut star Orlando Bloom with his predictions for this weekend's Premier League fixtures.\nDJ Admin, real name Rick Jansen, is the man tasked with keeping Max Verstappen’s ‘Orange Army’ entertained during the Dutch Grand Prix.\nAll the latest Premier League news conferences and build-up, plus transfer updates.\nNewcastle United are closing in on the signing of Germany striker Nick Woltemade in a move that could have a knock-on effect on Liverpool's pursuit of Alexander Isak.\nCoco Gauff credits superstar gymnast Simone Biles for helping bring a \"bit of calm\" as she finds a way to reach the US Open third round.\nMicah Parsons has been traded from the Dallas Cowboys to the Green Bay Packers in a deal worth $188m only one week before the start of a new NFL season.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n"
}